Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # helm_release.infisical will be created
+ resource "helm_release" "infisical" {
      + atomic                     = false
      + chart                      = "infisical-standalone"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "infisical"
      + namespace                  = "security"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dl.cloudsmith.io/public/infisical/helm-charts/helm/charts/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "controller":
                  "replicas": 1
                "image":
                  "repository": "infisical/infisical"
                  "tag": "v0.92.0-postgres"
                "infisical":
                  "image":
                    "repository": "infisical/infisical"
                    "tag": "v0.92.0-postgres"
                "ingress":
                  "enabled": false
                "kubeSecretRef": "infisical-secrets"
                "postgresql":
                  "enabled": false
                "redis":
                  "architecture": "standalone"
                  "auth":
                    "enabled": false
                  "enabled": true
                "resources":
                  "limits":
                    "cpu": "1000m"
                    "memory": "1Gi"
                  "requests":
                    "cpu": "500m"
                    "memory": "512Mi"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.7.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_ingress_v1.infisical will be created
+ resource "kubernetes_ingress_v1" "infisical" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
            }
          + generation       = (known after apply)
          + name             = "infisical-ingress"
          + namespace        = "security"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "i-secrets.truealpha.club"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "infisical-infisical-standalone-infisical"

                              + port {
                                  + number = 8080
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "i-secrets.truealpha.club",
                ]
              + secret_name = "infisical-tls"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://i-atlantis.truealpha.club/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`